In [36]:
#import libs
import numpy as np
import pandas as pd

In [37]:
#get the data
features = ["user_id", "item_id", "rating", "timestamp"]
df = pd.read_csv("u.data", sep="\t", names=features)
df.head()

   user_id  item_id  rating  timestamp
0        0       50       5  881250949
1        0      172       5  881250949
2        0      133       1  881250949
3      196      242       3  881250949
4      186      302       3  891717742

In [38]:
df.size

400012

In [39]:
#getting the movie titles
movies_titles = pd.read_csv("Movie_Id_Titles")
movies_titles.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [40]:
print(movies_titles.size)

3364

In [41]:
df = pd.merge(df,movies_titles,on="item_id")

In [42]:
df.tail(10)

,user_id,item_id,rating,timestamp,title
99993,416,1594,5,893212484,Everest (1998)
99994,648,1626,1,884795447,Nobody Loves Me (Keiner liebt mich) (1994)
99995,655,1645,4,892871225,"Butcher Boy, The (1998)"
99996,747,1659,1,888733313,Getting Away With Murder (1996)
99997,916,1682,3,880845755,Scream of Stone (Schrei aus Stein) (1991)
99998,840,1674,4,891211682,Mamma Roma (1962)
99999,655,1640,3,888474646,"Eighth Day, The (1996)"
100000,655,1637,3,888984255,Girls Town (1996)
100001,655,1630,3,887428735,"Silence of the Palace, The (Saimt el Qusur) (1..."
100002,655,1641,3,887427810,Dadetown (1995)

In [43]:
df.size

500015

In [44]:
df = df.drop_duplicates()
df.size

500015

In [45]:
import matplotlib.pyplot as plt
import seaborn as sns
sns.set_style("white")
%matplotlib inline

In [54]:
df.groupby('title')['rating'].mean().sort_values(ascending=False).head()

title
They Made Me a Criminal (1939)                5.0
Marlene Dietrich: Shadow and Light (1996)     5.0
Saint of Fort Washington, The (1993)          5.0
Someone Else's America (1995)                 5.0
Star Kid (1997)                               5.0
Name: rating, dtype: float64

In [56]:
df.groupby('title')['rating'].count().sort_values(ascending=False).head()

title
Star Wars (1977)             584
Contact (1997)               509
Fargo (1996)                 508
Return of the Jedi (1983)    507
Liar Liar (1997)             485
Name: rating, dtype: int64

In [57]:
ratings = pd.DataFrame(df.groupby('title')['rating'].mean())
ratings.head()

                             rating
title
'Til There Was You (1997)  2.333333
1-900 (1994)               2.600000
101 Dalmatians (1996)      2.908257
12 Angry Men (1957)        4.344000
187 (1997)                 3.024390